@echo off
chcp 65001 >nul

rem ==========================================================
rem Trading System
rem APP API 起動バッチ
rem
rem 起動:
rem   start_app.bat
rem       DEV環境
rem
rem   start_app.bat DEV
rem       DEV環境
rem
rem   start_app.bat PROD
rem       PROD環境
rem
rem 停止:
rem   Ctrl + C
rem
rem 再起動:
rem   s
rem
rem 終了:
rem   exit
rem
rem ==========================================================

rem ==========================================================
rem 環境設定
rem ==========================================================

set ENV=%~1

if "%ENV%"=="" set ENV=DEV

if /i not "%ENV%"=="PROD" if /i not "%ENV%"=="DEV" (
    echo.
    echo ERROR: PROD または DEV を指定してください。
    echo.
    echo   start_app.bat
    echo   start_app.bat DEV
    echo   start_app.bat PROD
    echo.
    exit /b 1
)

rem ==========================================================
rem ウィンドウタイトル
rem ==========================================================

title APP API %ENV%

rem ==========================================================
rem 起動コマンド設定
rem ==========================================================

set APP_CMD=python -m app.main

rem ==========================================================
rem プロジェクトルート設定
rem ==========================================================

set ROOT=%~dp0
set ROOT=%ROOT:~0,-1%

rem ==========================================================
rem venv起動
rem ==========================================================

call "%ROOT%\venv\Scripts\activate.bat"

rem ==========================================================
rem Python Path設定
rem ==========================================================

set PYTHONPATH=%ROOT%\program;%ROOT%

rem ==========================================================
rem 再起動用コマンド登録
rem ==========================================================

doskey s=%APP_CMD%

rem ==========================================================
rem APP起動
rem ==========================================================

echo.
echo ==========================
echo APP API %ENV% START
echo ==========================
echo.

%APP_CMD%


rem ==========================================================
rem 終了後
rem ==========================================================

echo.
echo ==========================
echo APP API %ENV% STOPPED
echo ==========================
echo.

echo 再起動する場合: s + [ENTER]

echo.

doskey s=%APP_CMD%

cmd
